In [1]:
person = {
    "first": "Corey", 
    "last": "Schafer", 
    "email": "CoreyMSchafer@gmail.com"
}

In [2]:
people = {
    "first": ["Corey"], 
    "last": ["Schafer"], 
    "email": ["CoreyMSchafer@gmail.com"]
}

In [3]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [5]:
people["email"]

['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']

In [6]:
#creating dataframe 
import pandas as pd
data = pd.DataFrame(people)
data

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [7]:
#To access single column
data["email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

In [8]:
type(data)

pandas.core.frame.DataFrame

In [9]:
type(data["email"])

pandas.core.series.Series

In [10]:
#To access one or more column
data[["last", "email"]]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com
2      Doe        JohnDoe@email.com

In [12]:
#To see all the columns
data.columns

Index(['first', 'last', 'email'], dtype='object')

In [26]:
#in iloc we have to use only the integer
#in loc we can use both integer and labels(column name)

In [13]:
#iloc - integer location - use integer index to grab columns
data.iloc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [18]:
data.iloc[[0,2]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
2   John      Doe        JohnDoe@email.com

In [19]:
#To grab index position 0 and 2's email..email columnd position is 2
data.iloc[[0,2], [2]]

                     email
0  CoreyMSchafer@gmail.com
2        JohnDoe@email.com

In [21]:
#To grab index position 0 and 2's lastname, email..last name position is 1 and email column position is 2
data.iloc[[0,2], [1,2]]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
2      Doe        JohnDoe@email.com

In [22]:
#loc
data.loc[0]

first                      Corey
last                     Schafer
email    CoreyMSchafer@gmail.com
Name: 0, dtype: object

In [23]:
data.loc[[0,1]]

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com

In [24]:
#To grab email column of first 2 rows with index 0 and 1
data.loc[[0,1], "email"]

0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
Name: email, dtype: object

In [25]:
#To grab last and email column of first 2 rows with index 0 and 1
data.loc[[0,1], ["last","email"]]

      last                    email
0  Schafer  CoreyMSchafer@gmail.com
1      Doe        JaneDoe@email.com